app/controllers/user_sessions_controller.rb

INSERT INTO `users` (`name`, `created_at`, `last_request_at`, `crypted_password`, `updated_at`, `perishable_token`, `facebook_uid`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `facebook_session_key`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES(NULL, '2010-03-21 22:57:39', NULL, NULL, '2010-03-21 22:57:39', 'El5OTb05RlcocFoxI-8o', 100000818989492, NULL, NULL, NULL, NULL, 0, '3.LMJRRsTfRrCnhOHPgFkh3w__.3600.1269216000-100000818989492', NULL, NULL, NULL, '')
---
  def create
    debugger
    @user_session = UserSession.new(params[:user_session])
    debugger
    if @user_session.save