app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `created_at`, `last_request_at`, `crypted_password`, `updated_at`, `perishable_token`, `facebook_uid`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `facebook_session_key`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES(NULL, '2010-03-21 23:01:46', '2010-03-21 23:01:46', '774c8a49668e6464c7495317a9db8a53d4816b53e25e63b38824fd98a3e6fcdcee0fda1cfe16d686f9de18fb7a461e3376f199d4f843ae407eb3675b4d08d353', '2010-03-21 23:01:46', 'sCfR7T2zou8-ynaSjHhu', NULL, '127.0.0.1', 'scYtS_lqdDRR1Z6VFict', '2010-03-21 23:01:46', '7d4a3b18f78577f3f7c5fe451de88488eaf705a48f0356e7a4750c41122d49727d9c4865f77a29d390dd55ae389ab53b891ab5128031c2cc3c15560a8bcf3aaf', 1, NULL, NULL, 'user', NULL, 'chris@test.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE `users` SET `updated_at` = '2010-03-21 23:48:02', `login` = 'user2', `crypted_password` = '69267fc491b6d6302aed6a3835ee3de9d7269e1682aeb101e2a2868c50638ea9d98da6d16b8157d7cb4b9583fa3532836b9261869fa2f021ad7db1f8b1e52e0b', `perishable_token` = 'IXcqKLngnywXmmrsirWh', `last_login_at` = '2010-03-21 23:38:43', `email` = 'chris@test2.com', `current_login_at` = '2010-03-21 23:48:02', `password_salt` = 'myyc3zxMjJCHLmIEClDY', `login_count` = 5, `persistence_token` = '8eee2044b3310c1fd4f63b8ee16c50a4cc824ec73ed9803b479c9dda6a6189ed08dc147f20569f51cc1e14992adb6b1d722723fbd2dcec4a22e04d4d54c7ff04', `last_request_at` = '2010-03-21 23:48:02' WHERE `id` = 1
---
  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])